//        1. Сделано
//
//        2.
//        a) О(1)
//        b) О(n)
//        c) О(1)
//        d) O(n)
//        e) О(n)
//
//        3.
//        a) O(n*logn) - 140 000 итераций
//        b) O(n^2) - 25 млн. итераций (почти угадала)
//        c) O(n) - 3000 (а реально около 10000) достаточно близко :)
//        d) O(n) - думала, что количество будет стремиться к бесконечности.
//            А оказалось, что количество итераций = 10000.
//            И думала, что сложность O(!n), а оказалось, что просто n.
//        e) O(n^2) - думала, что тут тоже O(!n), по тестам оказалось, что сложность ближе всего к O(2^n).
//            Количество итераций с помощью кода посчитать не удалось, так как IntelliJ либо зависает,
//            либо я не дождалась расчетов. Приблизительно количество операций будет более 1 триллиона.